function SetModify()
	--Menu_System_old=Menu_System;         --备份原始函数，如果新的函数需要，还可以调用原始函数。
	--Menu_System=Menu_System_new;

	--ExecDoctor_old=ExecDoctor;         --新的医疗函数
	--ExecDoctor=ExecDoctor_new;

	--War_PersonLostLife_old=War_PersonLostLife;         --新的中毒减少生命函数
	--War_PersonLostLife=War_PersonLostLife_new;

	instruct_11_old=instruct_11;         --新的指令
	instruct_11=instruct_11_new;

	instruct_45_old=instruct_45;
	instruct_45=instruct_45_new;

	instruct_46_old=instruct_46;
	instruct_46=instruct_46_new;

	instruct_47_old=instruct_47;
	instruct_47=instruct_47_new;

	instruct_48_old=instruct_48;
	instruct_48=instruct_48_new;

	DrawBoxTitle=NewDrawBoxTitle

	--在此定义特殊物品。没有定义的均调用缺省物品函数
	JY.ThingUseFunction[182]=Show_Position;     --罗盘函数


	--修改CC的常量

	CC.FontBIG=math.modf(math.min(CC.ScreenW,CC.ScreenH)/12)	--最大，未使用	640x480时size=40
	CC.FontBig=math.modf(math.min(CC.ScreenW,CC.ScreenH)/15)	--较大，游戏开始菜单使用	640x480时size=32
	CC.Fontbig=math.modf(math.min(CC.ScreenW,CC.ScreenH)/20)	--通常字号，对话菜单等使用	640x480时size=24
	CC.Fontsmall=math.modf(math.min(CC.ScreenW,CC.ScreenH)/24)	--稍小字号	640x480时size=20
	CC.FontSmall=math.modf(math.min(CC.ScreenW,CC.ScreenH)/30)	--较小字号	640x480时size=16
	CC.FontSMALL=math.modf(math.min(CC.ScreenW,CC.ScreenH)/40)	--最小字号	640x480时size=12
	CC.RowPixel=math.modf(math.min(CC.ScreenW,CC.ScreenH)/100)         -- 每行字的间距像素数
	--各种贴图文件名。
	CC.SMAPPicFile={CONFIG.DataPath .. "sdx",CONFIG.DataPath .. "smp"};
	CC.WMAPPicFile={CONFIG.DataPath .. "wdx",CONFIG.DataPath .. "wmp"};
	CC.FightPicFile={CONFIG.DataPath .. "fight/fdx%03d",CONFIG.DataPath .. "fight/fmp%03d"};   --此处为字符串格式，类似于C中printf的格式。

	--离队人员列表: {人员id，离队调用函数}      ----如果有新的离队人员加入，直接在这里增加
	CC.PersonExit={
		{1,100},{2,102},{4,104},{9,106},{16,108},
		{17,110},{25,112},{28,114},{29,116},{30,118},
		{35,120},{36,122},{37,124},{38,126},{44,128},
		{45,130},{47,132},{48,134},{49,136},{51,138},
		{52,140},{53,142},{54,144},{55,146},{56,148},
		{58,150},{59,152},{63,154},{66,156},{72,158},
		{73,160},{74,162},{75,164},{76,166},{77,168},
		{78,170},{79,172},{80,174},{81,176},{82,178},
		{83,180},{84,182},{85,184},{86,186},{87,188},
		{88,190},{89,192},{90,194},{91,196},{92,198},
	};


	GZM={'二','三','四','五','六','七','八','九','十'}

	SZB={'一','二','三','四','五','六','七','八','九','十',
	'十一','十二','十三','十四','十五','十六','十七','十八','十九','二十'}

	LMSJ={'少商剑','商阳剑','中冲剑','关冲剑','少冲剑','少泽剑'}
	XL18={'亢龙有悔','见龙在田','飞龙在天','双龙出水','神龙摆尾','潜龙勿用'}			
	XL18JY={'极意--亢龙·鸿渐於陆','极意--飞龙·或跃在渊','极意--潜龙·密雨不云','极意--神龙·震惊百里','极意--见龙·利涉大川','极意--双龙·突如其来','极意--六龙·履霜冰至','极意--龙战·损则有孚'}
	HDZC={'真传·云龙三现','秘技·上步摘星刀','秘技·鹞子翻身刀'}
	TFSSJ={"·『天道惊雷憾』"  , "·『一剑镇神洲』" ,  "·『羽葬煌炎斩』",  "·『千机龙绝闪』"  , "·『斗焰罡霸体』" ,"·『侠行天下』","·『八门聚万象』"}

	ZJTF={
		"灵犀真拳",--ok
		"剑神一笑",--ok
		"傲世狂刀",--ok
		"棍藏天机",--ok
		"绝世天罡",--ok
		"仁者无敌",--ok
		"回天圣手" 
	};

	TFE={"拳","剑","刀","特","罡","仁","医"}

	KJDYSAVE={"存档一","存档二","存档三","不存档"}
	KJDYLOAD={"存档一","存档二","存档三","不读档"}

	WARSZJY={
		3,2,5,2,40,15,5,5,5,5,
		5,5,5,5,3,2,2,10,5,4,
		4,5,4,2,2,20,40,2,3,3,
		3,3,3,3,5,3,4,4,8,8,
		4,4,4,4,2,5,3,4,3,30,
		4,2,3,3,4,4,15,5,5,15,
		3,15,3,15,10,2,8,3,15,7,
		8,3,3,3,4,2,2,2,2,4,
		2,2,2,3,2,2,2,2,2,2,
		2,2,2,2,2,2,7,7,4,4,
		2,2,12,2,2,2,3,3,3,3,
		3,7,7,50,3,3,5,6,3,3,
		3,3,3,3,3,3,3,3,20,3,
		3,3,3,3,3,3,2,3,2,35,
		2,2,2,2,2,2,2,2,3,3,
		3,3,3,3,3,3,3,3,3,3,
		3,3,3,3,3,3,3,3,3,3,
		4,3,4,4,4,2,2,2,2,2,
		2,2,3,7,7,4,3,5,5,3 
	};

	RWWH={};
	RWWH[50]="狂龙天征"
	RWWH[53]="六脉真传"
	RWWH[67]="铁掌帮主"
	RWWH[51]="姑苏慕容"
	RWWH[35]="九剑传人"
	RWWH['35']='剑魔再临'
	RWWH[69]="北丐"
	RWWH[27]="唯我不败"
	RWWH[64]="顽童武痴"
	RWWH[55]="侠之大者"
	RWWH[58]="西狂"
	RWWH[59]="联心素女"
	RWWH[9]="九阳明尊"
	RWWH[76]="琅嬛仙子"
	RWWH[75]="天池红花"
	RWWH[37]="真名神照"
	RWWH[56]="奇术无双"
	RWWH[60]="西毒"
	RWWH[1]="雪山飞狐"
	RWWH[54]="气侠风雷"
	RWWH[2]="毒手药仙"
	RWWH[16]="蝶谷医仙"
	RWWH[28]="杀人名医"
	RWWH[45]="阎王敌"
	RWWH[6]="月月轻松"	
	RWWH[114]="达摩再世" 
	RWWH[5]="太极宗师"
	RWWH[103]="大轮明王"
	RWWH[48]="冰毒怪客"
	RWWH[47]="铁丑之主"
	RWWH[129]="中神通"
	RWWH[57]="桃花岛主"
	RWWH[65]="南僧"
	RWWH[63]="青萧落瑛"
	RWWH[78]="铁尸魔煞"
	RWWH[73]="日月圣姑"
	RWWH[36]="辟邪剑客"
	RWWH[29]="万里独行"
	RWWH[72]="天龙掌门"
	RWWH[4]="雁过拨毛"	
	RWWH[25]="五毒教主"	
	RWWH[83]="铁袖拂风"	
	RWWH[17]="毒手姑婆"	
	RWWH[91]="青青子衿"	
	RWWH[74]="翠羽黄衫"	
	RWWH[80]="火手判官"	
	RWWH[62]="元蒙帝师"		
	RWWH[84]="吾乃蛮夷"	
	RWWH[85]="老谋深算"	
	RWWH[66]="波斯圣女"		
	RWWH[81]="灵獒毒娇"	
	RWWH[77]="鸳鸯刀客"	
	RWWH[88]="酒神"	
	RWWH[89]="食神"
	RWWH[90]="毓秀灵姝"	
	RWWH[44]="凶神恶煞"
	RWWH[52]="中平神枪"
	RWWH[82]="玉面孟尝"
	RWWH[92]="我本佳人"
	RWWH[97]="茹毛饮血"
	RWWH[79]="慧中灵剑"
	RWWH[26]="日月魔帝"
	RWWH[553]="真田一之兵"
	RWWH['01']="苍半无双"
	RWWH['01b']="真苍半无双"
	RWWH['02']="百花谷主"
	RWWH['03']="血翼军神"
	RWWH['04']="觉醒之苍龙"
	RWWH['49']="逍遥掌门"
	RWWH['38']="白首太玄"

	RWTFLB={};
	RWTFLB[50]="奋英雄怒"
	RWTFLB[49]="福缘深厚"
	RWTFLB[35]="灵奇洒脱"
	RWTFLB[55]="大器晚成"
	RWTFLB[58]="逆流勇进"
	RWTFLB[76]="博闻强记"
	RWTFLB[56]="兰心慧质"
	RWTFLB[38]="质朴刚健"
	RWTFLB[6]="那个不痛"
	RWTFLB[1]="魂系一刀"
	RWTFLB[37]="赤心连城"
	RWTFLB[53]="磊落仁心"
	RWTFLB[51]="离合参商"
	RWTFLB[48]="心无所住"
	RWTFLB[64]="童真永留"
	RWTFLB[60]="倒行逆施"
	RWTFLB[63]="外和内刚"
	RWTFLB[87]="媚眼如丝"
	RWTFLB[86]="倾国倾城"
	RWTFLB[73]="琴铮盈盈"
	RWTFLB[74]="巾帼之才"
	RWTFLB[80]="勇猛精进"
	RWTFLB[59]="冷剑冰花"
	RWTFLB[9]="谁与争峰"
	RWTFLB[82]="我为伊狂"
	RWTFLB[54]="志垂日月"
	RWTFLB[553]="赤胆忠魂"
	RWTFLB['01']="颖悟绝伦"
	RWTFLB['02']="万般皆通"
	RWTFLB['03']="慈严掌兵"

	TeamP={  
		0,1,2,4,9,16,
		17,25,28,29,30,
		35,36,37,38,44,
		45,47,48,49,51,
		52,53,54,55,56,
		58,59,63,66,72,
		73,74,75,76,77,
		78,79,80,81,82,
		83,84,85,86,87,
		88,89,90,91,92
	};

	FLHSYL={
		"其疾如风",
		"其徐如林",
		"侵略如火",
		"不动如山",
		"难知如阴",
		"动如雷震",
		"六如苍龙诀"
	};

	YYGZT={"风林火山功",
	"六如苍龙诀"};

	TSXMLB={"零二七","水镜四奇","萧雨客"}			

	MODEXZ={

		"初次接触本作和不擅长玩游戏者",
		"请选择『初入江湖』模式"
	};

	MODEXZ2={"初入江湖","千锤百炼","龙形舞天"}

	TFXZSAY1=" 朔雪飘飘开雁门 * 平沙历乱卷蓬根 * 功名耻计擒生数 * 直斩楼兰报国恩 "
	TFXZSAY2=" 【灵犀真拳】 * 【剑神一笑】 * 【傲世狂刀】 * 【棍藏天机】 * 【绝世天罡】 * 【仁者无敌】 * 【回天圣手】 "  

	XKXSJ={
		"赵客缦胡缨 吴钩霜雪明",
		"十步杀一人 千里不留行",
		"纵死侠骨香 不惭世上英",
		"谁能书阁下 白首太玄经"
	};

	GRTS={};
	GRTS[53]="凌波";
	GRTS[49]="催符";
	GRTS[89]="气补";
	GRTS[9]="挪移"
	GRTS[88]="传功";

	GRTSSAY={}
	GRTSSAY[53]="效果：至该角色下次行动为止*      闪避机率大幅提升*条件：消耗体力10点"
	GRTSSAY[49]="效果：催动敌人身上的生死符*      使其封穴25时序*条件：消耗体力5点 内力500点"
	GRTSSAY[89]="效果：回复指定邻接队友体力50点*条件：消耗体力25点 内力300点"
	GRTSSAY[9]="效果：将八格范围内的我方任一队友*      挪移到指定位置*条件：消耗体力10点 内力500点"
	GRTSSAY[88]="效果：将五格范围内我方任一队友*      当前集气提升500点*条件：消耗体力10点 内力700点"

	CC.ExtraOffense={{52,75,100},             --武功武器配合增加攻击力， 依次为：武器物品id，武功id，攻击力增加
	{45,67,100},
	{37,41,100},
	{49,80,200},
	{44,63,150},
	{40,40,150},
	{36,45,100},}

	CC.PersonAttribMax={};             --人物属性最大值
	CC.PersonAttribMax["经验"]=60000;
	CC.PersonAttribMax["物品修炼点数"]=30000;
	CC.PersonAttribMax["修炼点数"]=30000;
	CC.PersonAttribMax["生命最大值"]=999;
	CC.PersonAttribMax["受伤程度"]=100;
	CC.PersonAttribMax["中毒程度"]=100;
	CC.PersonAttribMax["内力最大值"]=5000;
	CC.PersonAttribMax["体力"]=100;
	CC.PersonAttribMax["攻击力"]=500;
	CC.PersonAttribMax["防御力"]=500;
	CC.PersonAttribMax["轻功"]=500;
	CC.PersonAttribMax["医疗能力"]=240;
	CC.PersonAttribMax["用毒能力"]=240;
	CC.PersonAttribMax["解毒能力"]=240;
	CC.PersonAttribMax["抗毒能力"]=240;
	CC.PersonAttribMax["拳掌功夫"]=240;
	CC.PersonAttribMax["御剑能力"]=240;
	CC.PersonAttribMax["耍刀技巧"]=240;
	CC.PersonAttribMax["特殊兵器"]=240;
	CC.PersonAttribMax["暗器技巧"]=240;
	CC.PersonAttribMax["武学常识"]=100;
	CC.PersonAttribMax["品德"]=100;
	CC.PersonAttribMax["资质"]=100;
	CC.PersonAttribMax["攻击带毒"]=240;


	CC.NewPersonName="徐小侠";                --新游戏的数据
	CC.NewGameSceneID=70;                      --场景ID
	CC.NewGameSceneX=16;                       --场景坐标
	CC.NewGameSceneY=31;
	CC.NewGameEvent=691;                       --新游戏场景执行事件。如果没有，则执行新游戏坐标路过事件。691
	CC.NewPersonPic=2515;                      --开始主角pic


	CC.LoadThingPic=1              --读取物品贴图方式 0 从mmap/smap/wmap中读取  1 读取独立的thing.idx/grp
	CC.StartThingPic=4131          --物品贴图在mmap/smap/wmap中的起始编号。CC.LoadThingPic=0有效
	CC.forg=false
	CC.KRP='./data/kdef.grp'
	CC.KDX='./data/kdef.idx'
	CC.TRP='./data/talk.grp'
	CC.TDX='./data/talk.idx'

	CC.MapKind=1;
	CC.MapSize=16;

	CC.AddAtk={
		{10,15,50},
		{11,15,50},
		{12,15,50},
		{13,15,50},
		{14,15,50},
		{48,47,100},
		{47,50,100},
		{53,76,100},
		{79,36,60},
		{74,75,50},
		{59,58,100},
		{54,91,100},
		{99,70,100},
		{119,65,50},
		{120,65,50},
		{121,65,50},
		{122,65,50},
		{68,129,50},
		{123,129,50},
		{124,129,50},
		{125,129,50},
		{126,129,50},
		{127,129,50},
		{128,129,50},
	};
	CC.AddDef={
		{76,51,100},
		{55,56,50},
		{56,55,100},
		{35,73,100},
		{79,36,60},
		{73,35,50},
		{74,75,50},
		{58,59,50},
		{59,58,50},
		{66,9,50},
		{91,54,100},
		{119,65,50},
		{120,65,50},
		{121,65,50},
		{122,65,50},
		{68,129,50},
		{123,129,50},
		{124,129,50},
		{125,129,50},
		{126,129,50},
		{127,129,50},
		{128,129,50},
	};
	CC.AddSpd={
		{25,35,50},
		{90,53,50},
		{55,56,100},
		{56,55,50},
		{35,79,100},
		{73,35,50},
		{74,75,50},
		{58,59,100},
		{63,58,60},
		{83,54,50},
	};
	CC.AddDoc={
		{2,1,120},
		{16,17,50},
	};
	CC.AddPoi={
		{17,16,50},
	};
	CC.Timer={
		stime=0,
		status=0,
		str='',
		len=0,
		fun=demostr,
	};
	CC.KfName={
		{2,'饭来张口',600},   --逍遥游3招
		{2,'沿门托钵',600},
		{2,'见人伸手',600},
		{3,'五毒摧心',700},
		{4,'锁喉',700},
		{4,'探目',700},
		{5,'寒冰封体',700},
		{6,'天罗地网',700},
		{7,'绵绵不绝',700},					
		{8,'阳歌天钧',900},   --天山六阳掌3招
		{8,'阳春白雪',900},
		{8,'阳关三叠',900},	
		{9,'雪山白驼',800},
		{10,'一错',800},
		{10,'再错',800},
		{11,'旋',800},
		{11,'钻',800},						
		{12,'珞樱缤纷',900},  --落英神剑掌3招
		{12,'雨急风狂',900},
		{12,'江城飞花',900},
		{14,'踏雪折梅',1000},
		{14,'天山灵鹫',1000},
		{15,'深藏若虚',1200}, --空明拳3招
		{15,'天马行空',1200},
		{15,'空空如也',1200},
		{16,'上步野马分鬃',1000}, --太极拳3招
		{16,'提步高探马',1000},
		{16,'白鹤晾翅',1000},
		{17,'一阳定乾坤',1200},
		{18,'弹指·一瞬',1200},
		{19,'魔幻天阴',1000},
		{20,'沛然有雨',1000},
		{21,'玄冥侵体',1000},
		{21,'冰毒缭绕',1000},
		{22,'金刚大手印',1000},
		{23,'七伤',1000},
		{24,'色空四显',1200},  --须弥山神掌3招
		{24,'无色无相',1200},
		{24,'慑伏外道',1200},
		{25,'拖泥带水',1300},  --销魂掌6招
		{25,'倒行逆施',1300},
		{25,'行尸走肉',1300},
		{25,'魂不守舍',1300},
		{25,'心惊肉跳',1300},
		{25,'六神不安',1300},


		{27,'平沙落雁式',300}, --松风剑术3招
		{27,'鸿飞冥冥',300},
		{27,'碧渊腾蛟',300},
		{28,'轰雷掣电',300}, --雷震剑术3招
		{28,'雷霆万钧',300},
		{28,'驱雷掣电',300},
		{29,'冰河倒泻',400}, --三分剑术3招
		{29,'雪中奇莲',400},
		{29,'冰河开冻',400},						
		{30,'万花齐放',500}, --恒山剑法3招
		{30,'万卉争艳',500},
		{30,'清澈梅花',500},	
		{31,'五大夫剑',500}, --泰山剑法3招
		{31,'岱宗如何',500},
		{31,'七星落长空',500},						
		{32,'泉鸣芙蓉',600}, --衡山剑法3招
		{32,'鹤翔紫盖',600},
		{32,'天柱云气',600},												
		{33,'叠翠浮青',600}, --嵩山剑法3招
		{33,'玉进天池',600},
		{33,'天外玉龙',600},						
		{34,'苍松迎客',600}, --华山剑法3招
		{34,'金雁横空',600},
		{34,'天坤倒悬',600},						
		{35,'雪泥鸿爪',600},  --雪山剑法3招
		{35,'梅雪争春',600},
		{35,'雪山六出',600},						
		{36,'杏花春雨',700},  --柔云剑法3招
		{36,'满天花雨',700},
		{36,'玉带围腰',700},												
		{38,'山外清音',800},  --玉萧剑法5招
		{38,'金声玉振',800},
		{38,'凤曲长鸣',800},
		{38,'响隔楼台',800},
		{38,'棹歌中流',800},												
		{40,'金蛇万道',900}, --金蛇剑法7招
		{40,'金蛇狂舞',900},
		{40,'金光蛇影',900},
		{40,'蛇影万馈',900},
		{40,'灵蛇电闪',900},
		{40,'蛇困愁城',900},
		{40,'金蛇化龙',900},																		
		{41,'灭',1000},        --灭剑绝剑2招
		{41,'绝',1000},						
		{42,'清饮小酌',1000},  --玉女素心剑6招
		{42,'浪迹天涯',1000},
		{42,'举案齐眉',1000},
		{42,'皓腕玉镯',1000},
		{42,'冷月窥人',1000},
		{42,'竹帘临池',1000},						
		{44,'冲天掌苏秦背剑',1000},  --苗家剑法6招
		{44,'黄龙转身吐须势',1000},
		{44,'迎门腿反劈华山',1000},
		{44,'洗剑怀中抱月',1000},
		{44,'上步云边摘月',1000},
		{44,'提撩剑白鹤舒翅',1000},						
		{45,'重剑无锋',1300},  --玄铁剑法3招
		{45,'大巧不工',1400},
		{45,'破尽天下',1500},
		{46,'大魁星',1300},  --太极剑法3招
		{46,'三环套月',1400},
		{46,'云麾三舞',1500},						
		{47,'总决式',1600},  --独孤九剑9招
		{47,'破剑式',1500},
		{47,'破枪式',1500},
		{47,'破刀式',1500},
		{47,'破鞭式',1500},
		{47,'破索式',1500},
		{47,'破掌式',1500},
		{47,'破箭式',1500},
		{47,'破气式',1600},
		{48,'扫荡群魔',1300},  --辟邪剑法6招
		{48,'紫气东来',1300},
		{48,'锺馗抉目',1300},		
		{48,'花开见佛',1300},
		{48,'直捣黄龙',1300},	
		{48,'指打奸邪',1300},	

		{50,'砍',500}, 
		{50,'劈',500},
		{52,'鬼见愁',600}, 
		{53,'铁锁横江',600},
		{53,'燕子入巢',600},
		{54,'大青',700},
		{54,'小青',700},
		{55,'狂风大作',700}, 
		{55,'飞沙走石',700},
		{56,'带醉脱靴',700},
		{56,'单刀破枪',700},						
		{57,'放下屠刀',600},
		{57,'立地成佛',600},
		{58,'恨意绵绵',600},
		{59,'白虎跳涧',600},
		{59,'剪扑自如',600},
		{60,'重节守义',700},
		{60,'万劫不复',700},
		{61,'梅雪逢夏',700},					
		{61,'赤日炎炎',700},	
		{62,'女貌郎才珠万斛',800},					
		{62,'天教丽质为眷属',800},	
		{62,'清风引佩下瑶台',800},					
		{62,'明月照妆成金屋',800},							
		{63,'呕心沥血',800},						
		{63,'批纸削腐',800},
		{63,'流星经天',800},						
		{65,'钻木取火',800},
		{65,'无名孽火',1100},
		{66,'烈火燎原',1200},
		{66,'举火烧天',1200},
		{67,'穿手藏刀式',1100},
		{67,'八方藏刀式',1100},

		{68,'回马枪',500},
		{68,'春雷震怒',500},
		{68,'凤点头',500},
		{70,'中正锁喉',600},
		{70,'枪平九洲',600},
		{71,'大君制六合',700},
		{71,'猛将清九垓',700},
		{74,'灵蛇吐信',700},
		{74,'冲天一鹤',700},
		{75,'咔嚓',800},
		{75,'我剪',800},
		{77,"金刀黑剑",600},
		{77,"假刀非刀",600},
		{77,"假剑非剑",600},
		{78,"血染黄沙",600},
		{78,"飞沙万里",600},
		{79,"银索缠身",900},
		{79,"锁穴金铃",900},
		{80,'棒打狗头',1000},
		{80,'反截狗臀',1000},
		{80,'獒口夺杖',1000},
		{80,'棒打双犬',1000},
		{80,'獒口夺杖',1000},
		{81,'书化丹心',1000},
		{81,'玄天一阳',1000},						
		{82,'祗园精舍',1100},
		{82,'诸行无常',1100},
		{82,'娑罗双树',1100},						
		{82,'幻梦一场',1100},
		{83,'力战千钧',1200},
		{83,'拔山填海',1200},
		{83,'千钧压顶',1200},
		{84,'武林至尊',800},
		{84,'宝刀屠龙',800},
		{84,'号令天下',900},
		{84,'莫敢不从',900},
		{84,'倚天不出',1000},
		{84,'谁与争锋',1000},
		{86,'天魔降伏',1100},
		{86,'降龙伏虎',1100},

		{109,'石头',1200},
		{109,'剪子',1200},
		{109,'布',1200},
		{110,'神洲移山剑',1200},
		{110,'神洲镇山剑',1200},
		{110,'神洲擎山剑',1200},
		{111,'切瓜',1200},
		{111,'剁瓜',1200},
		{111,'砍瓜',1200},
		{112,'一闪',1200},
		{112,'连一闪',1200},
		{112,'真一闪',1200},
	};
	CC.RUNSTR={
		'请注意不要让所持物品数量超过200',
		'令狐冲内伤未愈之前成长很低',
		'有些武功自身带有高连击机率',
		'有些武功自身带有高暴击机率',
		'请尽可能多培养一些队友',
		'请尽可能多培养一些队友',
		'主角各系天赋的终极技都非常强大',
		'和人对话时请尽量站在对方的正面  否则很没礼貌',
		'和人对话时请尽量站在对方的正面  否则很没礼貌',
		'飞雪连天射白鹿  笑书神侠倚碧鸳  红尘有你终相伴  笑傲江湖情两牵',
		'www.txdx.net',
	};
	
	-- 天赋信息
	
end
